docs/fileing files/ECF Operations/ReviewFiling/Alameda Superior Court/Civil & Small Claims/Subsequent Filing/Prejudgment Claim of Right to Possession submitted with a Fee Waiver request Sample.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://niem.gov/niem/niem-core/2.0" xmlns:ns10="urn:com.journaltech:ecourt:ecf:extension:CaseParticipantExt" xmlns:ns11="urn:com.journaltech:ecourt:ecf:extension:CoreFilingMessageExtType" xmlns:ns12="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:PaymentMessage-4.0" xmlns:ns13="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:ns14="urn:com.journaltech:ecourt:ecf:extension:PaymentMessageExt" xmlns:ns15="urn:oasis:names:tc:legalxml-courtfiling:wsdl:WebServicesProfile-Definitions-4.0" xmlns:ns16="com.journaltech.niem.test" xmlns:ns2="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CommonTypes-4.0" xmlns:ns3="http://niem.gov/niem/domains/jxdm/4.0" xmlns:ns4="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CivilCase-4.0" xmlns:ns5="urn:com.journaltech:ecourt:ecf:extension:CivilCaseTypeExt" xmlns:ns6="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CoreFilingMessage-4.0" xmlns:ns7="urn:un:unece:uncefact:data:specification:UnqualifiedDataTypesSchemaModule:2" xmlns:ns8="urn:com.journaltech:ecourt:ecf:extension:DocumentValue" xmlns:ns9="urn:com.journaltech:ecourt:ecf:extension:DocumentFilingMetaData" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <ns15:ReviewFilingRequestMessage>
      <ns2:SendingMDELocationID>
        <ns1:IdentificationID>YOUR_ENDPOINT_HERE</ns1:IdentificationID>
        <ns1:IdentificationSourceText>lasc</ns1:IdentificationSourceText>
      </ns2:SendingMDELocationID>
      <ns6:CoreFilingMessage xsi:type="ns11:CoreFilingMessageExtType">
        <ns1:DocumentFiledDate id="ref1">
          <ns1:DateTime>2021-08-10T10:12:53-07:00</ns1:DateTime>
        </ns1:DocumentFiledDate>
        <ns1:DocumentIdentification>
          <ns1:IdentificationID>YOUR_IDENTIFICATIONID_HERE</ns1:IdentificationID>
        </ns1:DocumentIdentification>
        <ns1:Case xsi:type="ns5:CivilCaseTypeExt">
          <ns1:CaseDocketID>21CV004193</ns1:CaseDocketID>
          <ns5:Complaint xmlns:st="http://niem.gov/niem/structures/2.0" st:id="1563738"/>
          <ns5:CaseAugmentationExt>
            <ns3:CaseCourt>
              <ns1:OrganizationIdentification>
                <ns1:IdentificationID>ecj-ecrtefm-s01.alameda.courts.ca.gov</ns1:IdentificationID>
                <ns1:IdentificationSourceText>lasc</ns1:IdentificationSourceText>
              </ns1:OrganizationIdentification>
              <ns3:CourtName>Alameda Superior Court</ns3:CourtName>
            </ns3:CaseCourt>
            <ns5:relatedParticipantDocuments>
              <ns5:associationType>FILEDBY</ns5:associationType>
              <ns5:participant xmlns:st="http://niem.gov/niem/structures/2.0" st:ref="filedBy-0-0"/>
              <ns5:relatedDocument xmlns:st="http://niem.gov/niem/structures/2.0" st:ref="doc1"/>
            </ns5:relatedParticipantDocuments>
          </ns5:CaseAugmentationExt>
        </ns1:Case>
        <ns6:FilingLeadDocument xmlns:st="http://niem.gov/niem/structures/2.0" complaintType="1563738" st:id="doc0" xsi:type="ns11:DocumentExtType">
          <ns1:DocumentBinary>
            <ns1:BinaryFormatStandardName xsi:type="ns7:TextType">application/pdf</ns1:BinaryFormatStandardName>
            <ns1:BinaryLocationURI>YOUR_URL_HERE</ns1:BinaryLocationURI>
          </ns1:DocumentBinary>
          <ns1:DocumentDescriptionText>PTY040</ns1:DocumentDescriptionText>
          <ns1:DocumentFileControlID>2142</ns1:DocumentFileControlID>
          <ns1:DocumentIdentification>
            <ns1:IdentificationID>PTY040</ns1:IdentificationID>
            <ns1:IdentificationSourceText>lasc</ns1:IdentificationSourceText>
          </ns1:DocumentIdentification>
          <ns9:DocumentFilingMetaData>
            <ns9:documentFilingMetaDataItem>
              <ns9:docValueMetaDataItem>
                <ns8:code>NEW_FILED_BY</ns8:code>
                <ns8:classType>caseParticipant</ns8:classType>
                <ns8:subType>filed-by</ns8:subType>
                <ns8:valueRestriction>new-data</ns8:valueRestriction>
              </ns9:docValueMetaDataItem>
              <ns9:caseParticipantValue st:id="filedBy-0-0">
                <ns2:EntityPerson id="ref2">
                  <ns1:PersonName>
                    <ns1:PersonGivenName>Anthony</ns1:PersonGivenName>
                    <ns1:PersonSurName>Perea</ns1:PersonSurName>
                  </ns1:PersonName>
                </ns2:EntityPerson>
                <ns2:CaseParticipantRoleCode>DEF</ns2:CaseParticipantRoleCode>
                <ns1:ContactInformation>
                  <ns1:ContactEmailID>any@gmail.com</ns1:ContactEmailID>
                </ns1:ContactInformation>
                <ns10:efmFeeExemptionRequestType>FEE_WAIVER</ns10:efmFeeExemptionRequestType>
              </ns9:caseParticipantValue>
            </ns9:documentFilingMetaDataItem>
            <ns9:documentFilingMetaDataItem>
              <ns9:docValueMetaDataItem>
                <ns8:code>FILED_BY_REPRESENTATION</ns8:code>
                <ns8:classType>attorney</ns8:classType>
                <ns8:subType>filed-by</ns8:subType>
                <ns8:valueRestriction>new-data</ns8:valueRestriction>
              </ns9:docValueMetaDataItem>
              <ns9:attorneyValue>
                <ns2:EntityOrganization id="ref3">
                  <ns1:OrganizationName>Babcock &amp;amp; Associates</ns1:OrganizationName>
                </ns2:EntityOrganization>
                <ns2:EntityPerson id="ref4">
                  <ns1:PersonName>
                    <ns1:PersonGivenName>Richard</ns1:PersonGivenName>
                    <ns1:PersonMiddleName>James</ns1:PersonMiddleName>
                    <ns1:PersonSurName>Babcock</ns1:PersonSurName>
                  </ns1:PersonName>
                  <ns1:PersonOtherIdentification>
                    <ns1:IdentificationID>144125</ns1:IdentificationID>
                    <ns1:IdentificationCategoryText>BAR</ns1:IdentificationCategoryText>
                  </ns1:PersonOtherIdentification>
                </ns2:EntityPerson>
                <ns2:CaseParticipantRoleCode>ATT</ns2:CaseParticipantRoleCode>
                <ns1:ContactInformation>
                  <sa1:ContactMailingAddress xmlns:sa1="http://niem.gov/niem/niem-core/2.0">
                    <sta1:StructuredAddress xmlns:sta1="urn:com.journaltech:ecourt:ecf:extension:StructuredAddressExt">
                      <sta1:LocationType>M</sta1:LocationType>
                      <sa1:LocationCountryName>US</sa1:LocationCountryName>
                      <sa1:AddressDeliveryPoint xsi:type="sa1:StreetType">
                        <sa1:StreetFullText>P.O. Box 12089</sa1:StreetFullText>
                      </sa1:AddressDeliveryPoint>
                      <sa1:LocationCityName>St. Thomas 00801</sa1:LocationCityName>
                      <sa1:LocationStateName>CO</sa1:LocationStateName>
                      <sa1:LocationState>CO</sa1:LocationState>
                      <sa1:LocationPostalCode>90001</sa1:LocationPostalCode>
                    </sta1:StructuredAddress>
                  </sa1:ContactMailingAddress>
                  <ns1:ContactEmailID>rich@babcockassociates.com</ns1:ContactEmailID>
                </ns1:ContactInformation>
              </ns9:attorneyValue>
            </ns9:documentFilingMetaDataItem>
          </ns9:DocumentFilingMetaData>
        </ns6:FilingLeadDocument>
        <ns6:FilingConnectedDocument xmlns:st="http://niem.gov/niem/structures/2.0" st:id="doc1" xsi:type="ns11:DocumentExtType">
          <ns1:DocumentBinary>
            <ns1:BinaryFormatStandardName xsi:type="ns7:TextType">application/pdf</ns1:BinaryFormatStandardName>
            <ns1:BinaryLocationURI>YOUR_URL_HERE</ns1:BinaryLocationURI>
          </ns1:DocumentBinary>
          <ns1:DocumentDescriptionText>FW001</ns1:DocumentDescriptionText>
          <ns1:DocumentFileControlID>2144</ns1:DocumentFileControlID>
          <ns1:DocumentIdentification>
            <ns1:IdentificationID>FW001</ns1:IdentificationID>
            <ns1:IdentificationSourceText>lasc</ns1:IdentificationSourceText>
          </ns1:DocumentIdentification>
          <ns9:DocumentFilingMetaData/>
        </ns6:FilingConnectedDocument>
        <ns11:messageToClerk>Prejudgment with FW</ns11:messageToClerk>
      </ns6:CoreFilingMessage>
	<ns10:PaymentMessage xsi:type="ns12:PaymentMessageTypeExt">
	  <ns12:paymentAuthorizationInfo>
	   <ns12:customerProfileId>0</ns12:customerProfileId>
	   <ns12:customerPaymentProfileId>0</ns12:customerPaymentProfileId>
	   <ns12:paymentType>ACH</ns12:paymentType>
	  </ns12:paymentAuthorizationInfo>
	</ns10:PaymentMessage>
    </ns15:ReviewFilingRequestMessage>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>